In [1]:
import pandas as pd 
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv("population_by_education_level.csv")

In [3]:
df.head()

  unit sex     age isced11 geography  date  value
0  THS   F  Y15-19   ED0-2        AT  2020  149.8
1  THS   F  Y15-19   ED0-2        BE  2020  247.9
2  THS   F  Y15-19   ED0-2        BG  2020  128.4
3  THS   F  Y15-19   ED0-2        CH  2020  168.2
4  THS   F  Y15-19   ED0-2        CY  2020   16.8

In [4]:
df.tail()

       unit sex     age isced11 geography  date   value
609971  THS   T  Y65-69   TOTAL        SE  1983     NaN
609972  THS   T  Y65-69   TOTAL        SI  1983     NaN
609973  THS   T  Y65-69   TOTAL        SK  1983     NaN
609974  THS   T  Y65-69   TOTAL        TR  1983     NaN
609975  THS   T  Y65-69   TOTAL        UK  1983  2532.5

In [5]:
df.shape

(609976, 7)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 609976 entries, 0 to 609975
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   unit       609976 non-null  object
 1   sex        609976 non-null  object
 2   age        609976 non-null  object
 3   isced11    609976 non-null  object
 4   geography  609976 non-null  object
 5   date       609976 non-null  int64
 6   value      361370 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 32.6+ MB

In [7]:
df.describe()

                date          value
count  609976.000000  361370.000000
mean     2001.500000    4437.056919
std        10.965865   16716.155159
min      1983.000000       0.400000
25%      1992.000000      84.500000
50%      2001.500000     400.050000
75%      2011.000000    1947.575000
max      2020.000000  380593.300000

In [8]:
df.isnull().sum()

unit              0
sex               0
age               0
isced11           0
geography         0
date              0
value        248606
dtype: int64